xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_tim3.c
/**
  ******************************************************************************
  * @file stm8_tim3.c
  * @brief This file contains all the functions for the TIM3 peripheral.
  * @author STMicroelectronics
  * @version V0.04
  * @date 21-DEC-2007
  ******************************************************************************
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH SOFTWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2007 STMicroelectronics</center></h2>
  * @image html logo.bmp
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm8_tim3.h"

/* LINKER SECTIONS DEFINITION FOR THIS FILE ONLY */
#ifdef USE_COSMIC_SECTIONS
#pragma section (TIM3_CODE)
#pragma section const {TIM3_CONST}
#pragma section @near [TIM3_URAM]
#pragma section @near {TIM3_IRAM}
#pragma section @tiny [TIM3_UZRAM]
#pragma section @tiny {TIM3_IZRAM}
#endif

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

/* TIM3 private Masks */
#define TIM3_PERIOD_RESET_MASK             ((u16)0xFFFF)
#define TIM3_PRESCALER_RESET_MASK          ((u8)0x00)
#define TIM3_PULSE_RESET_MASK              ((u16)0x0000)
#define TIM3_ICFILTER_MASK                 ((u8)0x00)


/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
static void TI1_Config(u8 TIM3_ICPolarity, u8 TIM3_ICSelection,
                       u8 TIM3_ICFilter);
static void TI2_Config(u8 TIM3_ICPolarity, u8 TIM3_ICSelection,
                       u8 TIM3_ICFilter);
/**
  * @addtogroup TIM3_Public_Functions
  * @{
  */

/**
  * @brief Deinitializes the TIM3 peripheral registers to their default reset values.
  * @param[in] :
  * None
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Initialize TIM3 registers to their reset values.
  * @code
  * TIM3_DeInit();
  * @endcode
  */
void TIM3_DeInit(void)
{

    TIM3->CR1 		= TIM3_CR1_RESET_VALUE;
    TIM3->IER 		= TIM3_IER_RESET_VALUE;
    TIM3->SR2 		= TIM3_SR2_RESET_VALUE;

    /* Disable channels */
    TIM3->CCER1 	= TIM3_CCER1_RESET_VALUE;
    TIM3->CCMR1 	= TIM3_CCMR1_RESET_VALUE;
    TIM3->CCMR2 	= TIM3_CCMR2_RESET_VALUE;
    

    TIM3->CNTRH 	= TIM3_CNTRH_RESET_VALUE;
    TIM3->CNTRL 	= TIM3_CNTRL_RESET_VALUE;

    TIM3->PSCR	 	= TIM3_PSCR_RESET_VALUE;
    

    TIM3->ARRH 		= TIM3_ARRH_RESET_VALUE;
    TIM3->ARRL 		= TIM3_ARRL_RESET_VALUE;

    TIM3->CCR1H 	= TIM3_CCR1H_RESET_VALUE;
    TIM3->CCR1L 	= TIM3_CCR1L_RESET_VALUE;
    TIM3->CCR2H 	= TIM3_CCR2H_RESET_VALUE;
    TIM3->CCR2L 	= TIM3_CCR2L_RESET_VALUE;
    TIM3->SR1 		= TIM3_SR1_RESET_VALUE;
}


/**
  * @brief Initializes the TIM3 Time Base Unit according to the specified
  * parameters in the TIM3_TimeBaseInitStruct.
  * @param[in] TIM3_TimeBaseInitStruct pointer to a TIM3_TimeBaseInit_TypeDef
  * structure that contains the configuration information for the specified
  * TIM3 peripheral.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Initialize TIM3 registers to the values on TIM3_TimeBaseInitStruct.
  * @code
  * TIM3_TimeBaseInit(&TIM3_TimeBaseInitStruct);
  * @endcode
  */
void TIM3_TimeBaseInit(TIM3_TimeBaseInit_TypeDef* TIM3_TimeBaseInitStruct)
{
    /* Set the Autoreload value */
    TIM3->ARRH = (u8)(TIM3_TimeBaseInitStruct->TIM3_Period >> 8);
	TIM3->ARRL = (u8)(TIM3_TimeBaseInitStruct->TIM3_Period);
    
    /* Set the Prescaler value */
    TIM3->PSCR = (u8)(TIM3_TimeBaseInitStruct->TIM3_Prescaler);
}


/**
  * @brief Initializes the TIM3 Channel1 according to the specified parameters
  * in the TIM3_OCInitStruct.
  * @param[in] TIM3_OCInitStruct pointer to a TIM3_OCInit_TypeDef structure that
  * contains the configuration information for the TIM3 peripheral.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Initialize the TIM3 Channel1 according to the specified parameters in the
  * TIM3_OCInitStruct.
  * @code
  * TIM3_OC1Init(&TIM3_OCInitStruct);
  * @endcode
  */
void TIM3_OC1Init(TIM3_OCInit_TypeDef* TIM3_OCInitStruct)
{
    u8 tmpccmr1 = 0;


    /* Check the parameters */
    assert_param(IS_TIM3_OC_MODE_OK(TIM3_OCInitStruct->TIM3_OCMode));
    assert_param(IS_TIM3_OUTPUT_STATE_OK(TIM3_OCInitStruct->TIM3_OutputState));
    assert_param(IS_TIM3_OC_POLARITY_OK(TIM3_OCInitStruct->TIM3_OCPolarity));
 

    tmpccmr1 = TIM3->CCMR1;


    /* Disable the Channel 1: Reset the CCE Bit */
    TIM3->CCER1 &= (u8)(~TIM3_CCER1_CC1E);
    /* Reset the Output Compare Bits */
    tmpccmr1 &= (u8)(~TIM3_CCMR_OCM);

    /* Set the Ouput Compare Mode */
    tmpccmr1 |= TIM3_OCInitStruct->TIM3_OCMode;

    TIM3->CCMR1 = tmpccmr1;

    /* Set the Output State */
    if (TIM3_OCInitStruct->TIM3_OutputState == TIM3_OUTPUTSTATE_ENABLE)
    {
        TIM3->CCER1 |= TIM3_CCER1_CC1E;
    }
    else
    {
        TIM3->CCER1 &= (u8)(~TIM3_CCER1_CC1E);
    }


    /* Set the Output Polarity */
    if (TIM3_OCInitStruct->TIM3_OCPolarity == TIM3_OCPOLARITY_LOW)
    {
        TIM3->CCER1 |= TIM3_CCER1_CC1P;
    }
    else
    {
        TIM3->CCER1 &= (u8)(~TIM3_CCER1_CC1P);
    }

    /* Set the Pulse value */
    TIM3->CCR1H = (u8)(TIM3_OCInitStruct->TIM3_Pulse >> 8);
	TIM3->CCR1L = (u8)(TIM3_OCInitStruct->TIM3_Pulse);
    
