xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_tim3.c
}


/**
  * @brief Initializes the TIM3 Channel2 according to the specified
  * parameters in the TIM3_OCInitStruct.
  * @param[in] TIM3_OCInitStruct pointer to a TIM3_OCInit_TypeDef structure that
  * contains the configuration information for the TIM3 peripheral.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Initialize the TIM3 Channel2 according to the specified parameters in the
  * TIM3_OCInitStruct.
  * @code
  * TIM3_OC2Init(&TIM3_OCInitStruct);
  * @endcode
  */
void TIM3_OC2Init(TIM3_OCInit_TypeDef* TIM3_OCInitStruct)
{
    u8 tmpccmr2 = 0;

    /* Check the parameters */
    assert_param(IS_TIM3_OC_MODE_OK(TIM3_OCInitStruct->TIM3_OCMode));
    assert_param(IS_TIM3_OUTPUT_STATE_OK(TIM3_OCInitStruct->TIM3_OutputState));
    assert_param(IS_TIM3_OC_POLARITY_OK(TIM3_OCInitStruct->TIM3_OCPolarity));
    
    tmpccmr2 = TIM3->CCMR2;

    /* Disable the Channel 2: Reset the CCE Bit */
    TIM3->CCER1 &= (u8)(~TIM3_CCER1_CC2E);

    /* Reset the Output Compare Bits */
    tmpccmr2 &= (u8)(~TIM3_CCMR_OCM);

    /* Set the Ouput Compare Mode */
    tmpccmr2 |= TIM3_OCInitStruct->TIM3_OCMode;

    TIM3->CCMR2 = tmpccmr2;

    /* Set the Output State */
    if (TIM3_OCInitStruct->TIM3_OutputState == TIM3_OUTPUTSTATE_ENABLE)
    {
        TIM3->CCER1 |= TIM3_CCER1_CC2E;
    }
    else
    {
        TIM3->CCER1 &= (u8)(~TIM3_CCER1_CC2E);
    }

    

    /* Set the Output Polarity */
    if (TIM3_OCInitStruct->TIM3_OCPolarity == TIM3_OCPOLARITY_LOW)
    {
        TIM3->CCER1 |= TIM3_CCER1_CC2P;
    }
    else
    {
        TIM3->CCER1 &= (u8)(~TIM3_CCER1_CC2P);
    }


    /* Set the Pulse value */
    TIM3->CCR2H = (u8)(TIM3_OCInitStruct->TIM3_Pulse >> 8);
	TIM3->CCR2L = (u8)(TIM3_OCInitStruct->TIM3_Pulse);
    
}



/**
  * @brief Initializes the TIM3 peripheral according to the specified parameters
  * in the TIM3_ICInitStruct.
  * @param[in] TIM3_ICInitStruct pointer to a TIM3_ICInit_TypeDef structure that
  * contains the configuration information for the TIM3 peripheral.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * TI1_Config
  * TI2_Config
  * TIM3_SetIC1Prescaler
  * TIM3_SetIC2Prescaler
  * @par Example:
  * Initialize the TIM3 Channel1 according to the specified parameters in the
  * TIM3_ICInitStruct.
  * @code
  * TIM3_ICInit(&TIM3_ICInitStruct);
  * @endcode
  */
void TIM3_ICInit(TIM3_ICInit_TypeDef* TIM3_ICInitStruct)
{
    /* Check the parameters */
    assert_param(IS_TIM3_CHANNEL_OK(TIM3_ICInitStruct->TIM3_Channel));
    assert_param(IS_TIM3_IC_POLARITY_OK(TIM3_ICInitStruct->TIM3_ICPolarity));
    assert_param(IS_TIM3_IC_SELECTION_OK(TIM3_ICInitStruct->TIM3_ICSelection));
    assert_param(IS_TIM3_IC_PRESCALER_OK(TIM3_ICInitStruct->TIM3_ICPrescaler));
    assert_param(IS_TIM3_IC_FILTER_OK(TIM3_ICInitStruct->TIM3_ICFilter));

    if (TIM3_ICInitStruct->TIM3_Channel == TIM3_CHANNEL_1)
    {
        /* TI1 Configuration */
        TI1_Config(TIM3_ICInitStruct->TIM3_ICPolarity,
                   TIM3_ICInitStruct->TIM3_ICSelection,
                   TIM3_ICInitStruct->TIM3_ICFilter);

        /* Set the Input Capture Prescaler value */
        TIM3_SetIC1Prescaler(TIM3_ICInitStruct->TIM3_ICPrescaler);
    }
    else 
    {
        /* TI2 Configuration */
        TI2_Config(TIM3_ICInitStruct->TIM3_ICPolarity,
                   TIM3_ICInitStruct->TIM3_ICSelection,
                   TIM3_ICInitStruct->TIM3_ICFilter);

        /* Set the Input Capture Prescaler value */
        TIM3_SetIC2Prescaler(TIM3_ICInitStruct->TIM3_ICPrescaler);
    }
    
}


/**
  * @brief Configures the TIM3 peripheral in PWM Input Mode according to the
  * specified parameters in the TIM3_ICInitStruct.
  * @param[in] TIM3_ICInitStruct pointer to a TIM3_ICInit_TypeDef structure that
  * contains the configuration information for the TIM3 peripheral.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * TI1_Config
  * TI2_Config
  * TIM3_SetIC1Prescaler
  * TIM3_SetIC2Prescaler
  * @par Example:
  * Configure the TIM3 peripheral in PWM Input Mode according to the specified
  * parameters in the TIM3_ICInitStruct.
  * @code
  * TIM3_PWMIConfig(&TIM3_ICInitStruct);
  * @endcode
  */
void TIM3_PWMIConfig(TIM3_ICInit_TypeDef* TIM3_ICInitStruct)
{
    u8 icpolarity = TIM3_ICPOLARITY_RISING;
    u8 icselection = TIM3_ICSELECTION_DIRECTTI;

    /* Check the parameters */
    assert_param(IS_TIM3_PWMI_CHANNEL_OK(TIM3_ICInitStruct->TIM3_Channel));
    assert_param(IS_TIM3_IC_POLARITY_OK(TIM3_ICInitStruct->TIM3_ICPolarity));
    assert_param(IS_TIM3_IC_SELECTION_OK(TIM3_ICInitStruct->TIM3_ICSelection));
    assert_param(IS_TIM3_IC_PRESCALER_OK(TIM3_ICInitStruct->TIM3_ICPrescaler));

    /* Select the Opposite Input Polarity */
    if (TIM3_ICInitStruct->TIM3_ICPolarity == TIM3_ICPOLARITY_RISING)
    {
        icpolarity = TIM3_ICPOLARITY_FALLING;
    }
    else
    {
        icpolarity = TIM3_ICPOLARITY_RISING;
    }

    /* Select the Opposite Input */
    if (TIM3_ICInitStruct->TIM3_ICSelection == TIM3_ICSELECTION_DIRECTTI)
    {
        icselection = TIM3_ICSELECTION_INDIRECTTI;
    }
    else
    {
        icselection = TIM3_ICSELECTION_DIRECTTI;
    }

    if (TIM3_ICInitStruct->TIM3_Channel == TIM3_CHANNEL_1)
    {
        /* TI1 Configuration */
        TI1_Config(TIM3_ICInitStruct->TIM3_ICPolarity, TIM3_ICInitStruct->TIM3_ICSelection,
                   TIM3_ICInitStruct->TIM3_ICFilter);

        /* Set the Input Capture Prescaler value */
        TIM3_SetIC1Prescaler(TIM3_ICInitStruct->TIM3_ICPrescaler);

        /* TI2 Configuration */
        TI2_Config(icpolarity, icselection, TIM3_ICInitStruct->TIM3_ICFilter);

        /* Set the Input Capture Prescaler value */
        TIM3_SetIC2Prescaler(TIM3_ICInitStruct->TIM3_ICPrescaler);
    }
    else
    {
        /* TI2 Configuration */
        TI2_Config(TIM3_ICInitStruct->TIM3_ICPolarity, TIM3_ICInitStruct->TIM3_ICSelection,
                   TIM3_ICInitStruct->TIM3_ICFilter);

        /* Set the Input Capture Prescaler value */
        TIM3_SetIC2Prescaler(TIM3_ICInitStruct->TIM3_ICPrescaler);

