xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_tim3.c
        /* TI1 Configuration */
        TI1_Config(icpolarity, icselection, TIM3_ICInitStruct->TIM3_ICFilter);

        /* Set the Input Capture Prescaler value */
        TIM3_SetIC1Prescaler(TIM3_ICInitStruct->TIM3_ICPrescaler);
    }
}

/**
  * @brief Fills each TIM3_OCInitStruct member with its default value.
  * @param[in] TIM3_OCInitStruct pointer to a TIM3_OCInit_TypeDef structure which
  * will be initialized.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Fill each TIM3_OCInitStruct member with its default value.
  * @code
  * TIM3_OCStructInit(&TIM3_OCInitStruct);
  * @endcode
  */
void TIM3_OCStructInit(TIM3_OCInit_TypeDef* TIM3_OCInitStruct)
{
    /* Set the default configuration */
    TIM3_OCInitStruct->TIM3_OCMode = TIM3_OCMODE_TIMING;
    TIM3_OCInitStruct->TIM3_OutputState = TIM3_OUTPUTSTATE_DISABLE;    
    TIM3_OCInitStruct->TIM3_Pulse = TIM3_PULSE_RESET_MASK;
    TIM3_OCInitStruct->TIM3_OCPolarity = TIM3_OCPOLARITY_HIGH;
}


/**
  * @brief Fills each TIM3_ICInitStruct member with its default value.
  * @param[in] TIM3_ICInitStruct pointer to a TIM3_ICInit_TypeDef structure which
  * will be initialized.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Fill each TIM3_ICInitStruct member with its default value.
  * @code
  * TIM3_ICStructInit(&TIM3_ICInitStruct);
  * @endcode
  */
void TIM3_ICStructInit(TIM3_ICInit_TypeDef* TIM3_ICInitStruct)
{
    /* Set the default configuration */
    TIM3_ICInitStruct->TIM3_Channel = TIM3_CHANNEL_1;
    TIM3_ICInitStruct->TIM3_ICSelection = TIM3_ICSELECTION_DIRECTTI;
    TIM3_ICInitStruct->TIM3_ICPolarity = TIM3_ICPOLARITY_RISING;
    TIM3_ICInitStruct->TIM3_ICPrescaler = TIM3_ICPSC_DIV1;
    TIM3_ICInitStruct->TIM3_ICFilter = TIM3_ICFILTER_MASK;
}


/**
  * @brief Fills each TIM3_TimeBaseInitStruct member with its default value.
  * @param[in] TIM3_TimeBaseInitStruct pointer to a TIM3_TimeBaseInit_TypeDef
  * structure which will be initialized.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Fill each TIM3_TimeBaseInitStruct member with its default value.
  * @code
  * TIM3_TimeBaseStructInit(&TIM3_TimeBaseInitStruct);
  * @endcode
  */
void TIM3_TimeBaseStructInit(TIM3_TimeBaseInit_TypeDef* TIM3_TimeBaseInitStruct)
{
    /* Set the default configuration */
    TIM3_TimeBaseInitStruct->TIM3_Period = TIM3_PERIOD_RESET_MASK;
    TIM3_TimeBaseInitStruct->TIM3_Prescaler = TIM3_PRESCALER_RESET_MASK;
}

/**
  * @brief Enables or disables the TIM3 peripheral.
  * @param[in] NewState new state of the TIM3 peripheral.This parameter can
  * be ENABLE or DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Enable the TIM3 peripheral.
  * @code
  * TIM3_Cmd(ENABLE);
  * @endcode
  */
void TIM3_Cmd(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONALSTATE_OK(NewState));

    /* set or Reset the CEN Bit */
    if (NewState == ENABLE)
    {
        TIM3->CR1 |= TIM3_CR1_CEN;
    }
    else
    {
        TIM3->CR1 &= (u8)(~TIM3_CR1_CEN);
    }
}


/**
  * @brief Enables or disables the specified TIM3 interrupts.
  * @param[in] NewState new state of the TIM3 peripheral.
  * This parameter can be: ENABLE or DISABLE.
  * @param[in] TIM3_IT specifies the TIM3 interrupts sources to be enabled or disabled.
  * This parameter can be any combination of the following values:
  *                       - TIM3_IT_UPDATE: TIM3 update Interrupt source
  *                       - TIM3_IT_CC1: TIM3 Capture Compare 1 Interrupt source
  *                       - TIM3_IT_CC2: TIM3 Capture Compare 2 Interrupt source
  * @param[in] NewState new state of the TIM3 peripheral.

  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Enable the the TIM3_IT_UPDATE interrupt.
  * @code
  * TIM3_ITConfig(TIM3_IT_Update, ENABLE);
  * @endcode
  */
void TIM3_ITConfig(u8 TIM3_IT, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_TIM3_IT_OK(TIM3_IT));
    assert_param(IS_FUNCTIONALSTATE_OK(NewState));

    if (NewState == ENABLE)
    {
        /* Enable the Interrupt sources */
        TIM3->IER |= TIM3_IT;
    }
    else
    {
        /* Disable the Interrupt sources */
        TIM3->IER &= (u8)(~TIM3_IT);
    }
}


/**
  * @brief Enables or Disables the TIM3 Update event.
  * @param[in] NewState new state of the TIM3 peripheral Preload register.This parameter can
  * be ENABLE or DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Enable the TIM3 Update event.
  * @code
  * TIM3_UpdateDisableConfig(ENABLE);
  * @endcode
  */

void TIM3_UpdateDisableConfig(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONALSTATE_OK(NewState));

    /* Set or Reset the UDIS Bit */
    if (NewState == ENABLE)
    {
        TIM3->CR1 |= TIM3_CR1_UDIS;
    }
    else
    {
        TIM3->CR1 &= (u8)(~TIM3_CR1_UDIS);
    }
}

/**
  * @brief Selects the TIM3 Update Request Interrupt source.
  * @param[in] TIM3_UpdateSource specifies the Update source.
  * This parameter can be one of the following values
  *                       - TIM3_UPDATESOURCE_REGULAR
  *                       - TIM3_UPDATESOURCE_GLOBAL
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Select the TIM3 Update Request Interrupt source
  * @code
  * TIM3_UpdateRequestConfig(TIM3_UPDATESOURCE_GLOBAL);
  * @endcode
  */
void TIM3_UpdateRequestConfig(u8 TIM3_UpdateSource)
{
    /* Check the parameters */
    assert_param(IS_TIM3_UPDATE_SOURCE_OK(TIM3_UpdateSource));

    /* Set or Reset the URS Bit */
    if (TIM3_UpdateSource == TIM3_UPDATESOURCE_REGULAR)
    {
        TIM3->CR1 |= TIM3_CR1_URS;
    }
    else
    {
        TIM3->CR1 &= (u8)(~TIM3_CR1_URS);
    }
}


/**
  * @brief Selects the TIM3’s One Pulse Mode.
  * @param[in] TIM3_OPMode specifies the OPM Mode to be used.
  * This parameter can be one of the following values
  *                    - TIM3_OPMODE_SINGLE
  *                    - TIM3_OPMODE_REPETITIVE
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Select the TIM3 single One Pulse Mode
  * @code
  * TIM3_SelectOnePulseMode(TIM3_OPMODE_SINGLE);
  * @endcode
  */
void TIM3_SelectOnePulseMode(u8 TIM3_OPMode)
{
    /* Check the parameters */
    assert_param(IS_TIM3_OPM_MODE_OK(TIM3_OPMode));

    /* Set or Reset the OPM Bit */
    if (TIM3_OPMode == TIM3_OPMODE_SINGLE)
    {
        TIM3->CR1 |= TIM3_CR1_OPM;
    }
    else
    {
        TIM3->CR1 &= (u8)(~TIM3_CR1_OPM);
    }

