xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_tim3.c
}


/**
  * @brief Configures the TIM3 Prescaler.
  * @param[in] Prescaler specifies the Prescaler Register value
  * This parameter can be one of the following values
  *                       -  TIM3_PRESCALER_1		
  *                       -  TIM3_PRESCALER_2   		
  *                       -  TIM3_PRESCALER_4   		
  *                       -  TIM3_PRESCALER_8		
  *                       -  TIM3_PRESCALER_16  		
  *                       -  TIM3_PRESCALER_32    		
  *                       -  TIM3_PRESCALER_64   
  *                       -  TIM3_PRESCALER_128  
  *                       -  TIM3_PRESCALER_256  
  *                       -  TIM3_PRESCALER_512  
  *                       -  TIM3_PRESCALER_1024 
  *                       -  TIM3_PRESCALER_2048
  *                       -  TIM3_PRESCALER_4096    
  *                       -  TIM3_PRESCALER_8192
  *                       -  TIM3_PRESCALER_16384
  *                       -  TIM3_PRESCALER_32768
  * @param[in] TIM3_PSCReloadMode specifies the TIM3 Prescaler Reload mode.
  * This parameter can be one of the following values
  *                       - TIM3_PSCRELOADMODE_IMMEDIATE: The Prescaler is loaded
  *                         immediatly.
  *                       - TIM3_PSCRELOADMODE_UPDATE: The Prescaler is loaded at
  *                         the update event.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Configures the TIM3 Prescaler.
  * @code
  * TIM3_PrescalerConfig(TIM3_PRESCALER_1, TIM3_PSCRELOADMODE_UPDATE);
  * @endcode
  */

void TIM3_PrescalerConfig(u8 Prescaler, u8 TIM3_PSCReloadMode)
{
    /* Check the parameters */
    assert_param(IS_TIM3_PRESCALER_RELOAD_OK(TIM3_PSCReloadMode));
	assert_param(IS_TIM3_PRESCALER_OK(Prescaler));

    /* Set the Prescaler value */
    TIM3->PSCR = Prescaler;

    /* Set or reset the UG Bit */
    if (TIM3_PSCReloadMode == TIM3_PSCRELOADMODE_IMMEDIATE)
    {
        TIM3->EGR |= TIM3_EGR_UG;
    }
    else
    {
        TIM3->EGR &= (u8)(~TIM3_EGR_UG);
    }
}


/**
  * @brief Forces the TIM3 Channel1 output waveform to active or inactive level.
  * @param[in] TIM3_ForcedAction specifies the forced Action to be set to the output waveform.
  * This parameter can be one of the following values:
  *                       - TIM3_FORCEDACTION_ACTIVE: Force active level on OC1REF
  *                       - TIM3_FORCEDACTION_INACTIVE: Force inactive level on
  *                         OC1REF.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Force the TIM3 Channel1 output waveform to active or inactive level.
  * @code
  * TIM3_ForcedOC1Config(TIM3_FORCEDACTION_ACTIVE);
  * @endcode
  */
void TIM3_ForcedOC1Config(u8 TIM3_ForcedAction)
{
    u8 tmpccmr1 = 0;

    /* Check the parameters */
    assert_param(IS_TIM3_FORCED_ACTION_OK(TIM3_ForcedAction));

    tmpccmr1 = TIM3->CCMR1;

    /* Reset the OCM Bits */
    tmpccmr1 &= (u8)(~TIM3_CCMR_OCM);

    /* Configure The Forced output Mode */
    tmpccmr1 |= TIM3_ForcedAction;

    TIM3->CCMR1 = tmpccmr1;
}


/**
  * @brief Forces the TIM3 Channel2 output waveform to active or inactive level.
  * @param[in] TIM3_ForcedAction specifies the forced Action to be set to the output waveform.
  * This parameter can be one of the following values:
  *                       - TIM3_FORCEDACTION_ACTIVE: Force active level on OC2REF
  *                       - TIM3_FORCEDACTION_INACTIVE: Force inactive level on
  *                         OC2REF.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Force the TIM3 Channel2 output waveform to active or inactive level.
  * @code
  * TIM3_ForcedOC2Config(TIM3_FORCEDACTION_ACTIVE);
  * @endcode
  */
void TIM3_ForcedOC2Config(u8 TIM3_ForcedAction)
{
    u8 tmpccmr2 = 0;

    /* Check the parameters */
    assert_param(IS_TIM3_FORCED_ACTION_OK(TIM3_ForcedAction));

    tmpccmr2 = TIM3->CCMR2;

    /* Reset the OCM Bits */
    tmpccmr2 &= (u8)(~TIM3_CCMR_OCM);

    /* Configure The Forced output Mode */
    tmpccmr2 |= TIM3_ForcedAction;

    TIM3->CCMR2 = tmpccmr2;
}


/**
  * @brief Enables or disables TIM3 peripheral Preload register on ARR.
  * @param[in] NewState new state of the TIM3 peripheral Preload register.
  * This parameter can be ENABLE or DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Enable TIM3 peripheral Preload register on ARR.
  * @code
  * TIM3_ARRPreloadConfig(ENABLE);
  * @endcode
  */
void TIM3_ARRPreloadConfig(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONALSTATE_OK(NewState));

    /* Set or Reset the ARPE Bit */
    if (NewState == ENABLE)
    {
        TIM3->CR1 |= TIM3_CR1_ARPE;
    }
    else
    {
        TIM3->CR1 &= (u8)(~TIM3_CR1_ARPE);
    }
}


/**
  * @brief Enables or disables the TIM3 peripheral Preload Register on CCR1.
  * @param[in] NewState new state of the Capture Compare Preload register.
  * This parameter can be ENABLE or DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Enable the TIM3 peripheral Preload Register on CCR1.
  * @code
  * TIM3_OC1PreloadConfig(ENABLE);
  * @endcode
  */
void TIM3_OC1PreloadConfig(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONALSTATE_OK(NewState));

    /* Set or Reset the OC1PE Bit */
    if (NewState == ENABLE)
    {
        TIM3->CCMR1 |= TIM3_CCMR_OCxPE;
    }
    else
    {
        TIM3->CCMR1 &= (u8)(~TIM3_CCMR_OCxPE);
    }
}


/**
  * @brief Enables or disables the TIM3 peripheral Preload Register on CCR2.
  * @param[in] NewState new state of the Capture Compare Preload register.
  * This parameter can be ENABLE or DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Enable the TIM3 peripheral Preload Register on CCR2.
  * @code
  * TIM3_OC2PreloadConfig(ENABLE);
  * @endcode
  */
void TIM3_OC2PreloadConfig(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONALSTATE_OK(NewState));

    /* Set or Reset the OC2PE Bit */
    if (NewState == ENABLE)
    {
        TIM3->CCMR2 |= TIM3_CCMR_OCxPE;
    }
    else
    {
        TIM3->CCMR2 &= (u8)(~TIM3_CCMR_OCxPE);
    }
}


/**
  * @brief Configures the TIM3 event to be generated by software.
  * @param[in] TIM3_EventSource specifies the event source.
  * This parameter can be one of the following values:
  *                       - TIM3_EVENTSOURCE_UPDATE: TIM3 update Event source
  *                       - TIM3_EVENTSOURCE_CC1: TIM3 Capture Compare 1 Event source
  *                       - TIM3_EVENTSOURCE_CC2: TIM3 Capture Compare 2 Event source
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Configure the TIM3 event to be generated by software.
  * @code
  * TIM3_GenerateEvent(TIM3_EVENTSOURCE_UPDATE);
  * @endcode
  */
void TIM3_GenerateEvent(u8 TIM3_EventSource)
{
    /* Check the parameters */
    assert_param(IS_TIM3_EVENT_SOURCE_OK(TIM3_EventSource));

    /* Set the event sources */
    TIM3->EGR |= TIM3_EventSource;
}


/**
  * @brief Configures the TIM3 Channel 1 polarity.
  * @param[in] TIM3_OCPolarity specifies the OC1 Polarity.
  * This parameter can be one of the following values:
  *                       - TIM3_OCPOLARITY_LOW: Output Compare active low
  *                       - TIM3_OCPOLARITY_HIGH: Output Compare active high
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Configure the TIM3 Channel 1 polarity to High.
  * @code
  * TIM3_OC1PolarityConfig(TIM3_OCPOLARITY_HIGH);
  * @endcode
  */
void TIM3_OC1PolarityConfig(u8 TIM3_OCPolarity)
{
    /* Check the parameters */
    assert_param(IS_TIM3_OC_POLARITY_OK(TIM3_OCPolarity));

    /* Set or Reset the CC1P Bit */
    if (TIM3_OCPolarity == TIM3_OCPOLARITY_LOW)
    {
        TIM3->CCER1 |= TIM3_CCER1_CC1P;
    }
    else
    {
        TIM3->CCER1 &= (u8)(~TIM3_CCER1_CC1P);
    }
}


/**
  * @brief Configures the TIM3 Channel 2 polarity.
  * @param[in] TIM3_OCPolarity specifies the OC2 Polarity.
  * This parameter can be one of the following values:
  *                       - TIM3_OCPOLARITY_LOW: Output Compare active low
  *                       - TIM3_OCPOLARITY_HIGH: Output Compare active high
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Configure the TIM3 Channel 2 polarity to High.
  * @code
  * TIM3_OC2PolarityConfig(TIM3_OCPOLARITY_HIGH);
  * @endcode
  */
void TIM3_OC2PolarityConfig(u8 TIM3_OCPolarity)
{
    /* Check the parameters */
    assert_param(IS_TIM3_OC_POLARITY_OK(TIM3_OCPolarity));

