xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_tim3.c
    /* Set or Reset the CC2P Bit */
    if (TIM3_OCPolarity == TIM3_OCPOLARITY_LOW)
    {
        TIM3->CCER1 |= TIM3_CCER1_CC2P;
    }
    else
    {
        TIM3->CCER1 &= (u8)(~TIM3_CCER1_CC2P);
    }
}


/**
  * @brief Enables or disables the TIM3 Capture Compare Channel x.
  * @param[in] TIM3_Channel specifies the TIM3 Channel.
  * This parameter can be one of the following values:
  *                       - TIM3_Channel1: TIM3 Channel1
  *                       - TIM3_Channel2: TIM3 Channel2
  * @param[in] NewState specifies the TIM3 Channel CCxE bit new state.
  * This parameter can be: ENABLE or DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Enable the TIM3 Capture Compare Channel 1.
  * @code
  * TIM3_CCxCmd(TIM3_Channel1, ENABLE);
  * @endcode
  */
void TIM3_CCxCmd(u8 TIM3_Channel, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_TIM3_CHANNEL_OK(TIM3_Channel));
    assert_param(IS_FUNCTIONALSTATE_OK(NewState));

    if (TIM3_Channel == TIM3_CHANNEL_1)
    {
        /* Set or Reset the CC1E Bit */
        if (NewState == ENABLE)
        {
            TIM3->CCER1 |= TIM3_CCER1_CC1E;
        }
        else
        {
            TIM3->CCER1 &= (u8)(~TIM3_CCER1_CC1E);
        }

    }
    else 
    {
        /* Set or Reset the CC2E Bit */
        if (NewState == ENABLE)
        {
            TIM3->CCER1 |= TIM3_CCER1_CC2E;
        }
        else
        {
            TIM3->CCER1 &= (u8)(~TIM3_CCER1_CC2E);
        }
    }
    
}

/**
  * @brief Selects the TIM3 Ouput Compare Mode. This function disables the
  * selected channel before changing the Ouput Compare Mode. User has to
  * enable this channel using TIM3_CCxCmd and TIM3_CCxNCmd functions.
  * @param[in] TIM3_Channel specifies the TIM3 Channel.
  * This parameter can be one of the following values:
  *                       - TIM3_Channel1: TIM3 Channel1
  *                       - TIM3_Channel2: TIM3 Channel2
  * @param[in] TIM3_OCMode specifies the TIM3 Output Compare Mode.
  * This paramter can be one of the following values:
  *                       - TIM3_OCMODE_TIMING
  *                       - TIM3_OCMODE_ACTIVE
  *                       - TIM3_OCMODE_TOGGLE
  *                       - TIM3_OCMODE_PWM1
  *                       - TIM3_OCMODE_PWM2
  *                       - TIM3_FORCEDACTION_ACTIVE
  *                       - TIM3_FORCEDACTION_INACTIVE
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Selects the TIM3 Ouput Compare Mode TIM3_OCMODE_TIMING for channel1.
  * @code
  * TIM3_SelectOCxM(TIM3_Channel1, TIM3_OCMODE_TIMING);
  * @endcode
  */
void TIM3_SelectOCxM(u8 TIM3_Channel, u8 TIM3_OCMode)
{
    /* Check the parameters */
    assert_param(IS_TIM3_CHANNEL_OK(TIM3_Channel));
    assert_param(IS_TIM3_OCM_OK(TIM3_OCMode));

    if (TIM3_Channel == TIM3_CHANNEL_1)
    {
        /* Disable the Channel 1: Reset the CCE Bit */
        TIM3->CCER1 &= (u8)(~TIM3_CCER1_CC1E);

        /* Reset the Output Compare Bits */
        TIM3->CCMR1 &= (u8)(~TIM3_CCMR_OCM);

        /* Set the Ouput Compare Mode */
        TIM3->CCMR1 |= TIM3_OCMode;
    }
    else 
    {
        /* Disable the Channel 2: Reset the CCE Bit */
        TIM3->CCER1 &= (u8)(~TIM3_CCER1_CC2E);

        /* Reset the Output Compare Bits */
        TIM3->CCMR2 &= (u8)(~TIM3_CCMR_OCM);

        /* Set the Ouput Compare Mode */
        TIM3->CCMR2 |= TIM3_OCMode;
    }
}


/**
  * @brief Sets the TIM3 Counter Register value.
  * @param[in] Counter specifies the Counter register new value.
  * This parameter is between 0x0000 and 0xFFFF.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Set the TIM3 Counter Register value to 0xFFEE.
  * @code
  * TIM3_SetCounter(0xFFEE);
  * @endcode
  */
void TIM3_SetCounter(u16 Counter)
{
    /* Set the Counter Register value */
    TIM3->CNTRH = (u8)(Counter >> 8);
	TIM3->CNTRL = (u8)(Counter);
    
}


/**
  * @brief Sets the TIM3 Autoreload Register value.
  * @param[in] Autoreload specifies the Autoreload register new value.
  * This parameter is between 0x0000 and 0xFFFF.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Set the TIM3 Autoreload Register value to 0xFFEE.
  * @code
  * TIM3_SetAutoreload(0xFFEE);
  * @endcode
  */
void TIM3_SetAutoreload(u16 Autoreload)
{
    /* Set the Autoreload Register value */
    TIM3->ARRH = (u8)(Autoreload >> 8);
	TIM3->ARRL = (u8)(Autoreload);
	
	
    
}


/**
  * @brief Sets the TIM3 Capture Compare1 Register value.
  * @param[in] Compare1 specifies the Capture Compare1 register new value.
  * This parameter is between 0x0000 and 0xFFFF.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Set the TIM3 Capture Compare1 Register value to 0xFFEE.
  * @code
  * TIM3_SetCompare1(0xFFEE);
  * @endcode
  */
void TIM3_SetCompare1(u16 Compare1)
{
    /* Set the Capture Compare1 Register value */
    TIM3->CCR1H = (u8)(Compare1 >> 8);
	TIM3->CCR1L = (u8)(Compare1);
    
}


/**
  * @brief Sets the TIM3 Capture Compare2 Register value.
  * @param[in] Compare2 specifies the Capture Compare2 register new value.
  * This parameter is between 0x0000 and 0xFFFF.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Set the TIM3 Capture Compare2 Register value to 0xFFEE.
  * @code
  * TIM3_SetCompare2(0xFFEE);
  * @endcode
  */
void TIM3_SetCompare2(u16 Compare2)
{
    /* Set the Capture Compare2 Register value */
    TIM3->CCR2H = (u8)(Compare2 >> 8);
	TIM3->CCR2L = (u8)(Compare2);
    
}


/**
  * @brief Sets the TIM3 Input Capture 1 prescaler.
  * @param[in] TIM3_IC1Prescaler specifies the Input Capture prescaler new value
  * This parameter can be one of the following values:
  *                       - TIM3_ICPSC_DIV1: no prescaler
  *                       - TIM3_ICPSC_DIV2: capture is done once every 2 events
  *                       - TIM3_ICPSC_DIV4: capture is done once every 4 events
  *                       - TIM3_ICPSC_DIV8: capture is done once every 8 events
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Set the TIM3 Input Capture 1 prescaler to do a capture every 8 events.
  * @code
  * TIM3_SetIC1Prescaler(TIM3_ICPSC_DIV8);
  * @endcode
  */
void TIM3_SetIC1Prescaler(u8 TIM3_IC1Prescaler)
{
    u8 tmpccmr1 = 0;

    /* Check the parameters */
    assert_param(IS_TIM3_IC_PRESCALER_OK(TIM3_IC1Prescaler));

