xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_tim3.c
    tmpccmr1 = TIM3->CCMR1;

    /* Reset the IC1PSC Bits */
    tmpccmr1 &= (u8)(~TIM3_CCMR_ICxPSC);

    /* Set the IC1PSC value */
    tmpccmr1 |= TIM3_IC1Prescaler;

    TIM3->CCMR1 = tmpccmr1;
}

/**
  * @brief Sets the TIM3 Input Capture 2 prescaler.
  * @param[in] TIM3_IC2Prescaler specifies the Input Capture prescaler new value
  * This parameter can be one of the following values:
  *                       - TIM3_ICPSC_DIV1: no prescaler
  *                       - TIM3_ICPSC_DIV2: capture is done once every 2 events
  *                       - TIM3_ICPSC_DIV4: capture is done once every 4 events
  *                       - TIM3_ICPSC_DIV8: capture is done once every 8 events
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Set the TIM3 Input Capture 2 prescaler to do a capture every 8 events.
  * @code
  * TIM3_SetIC2Prescaler(TIM3_ICPSC_DIV8);
  * @endcode
  */
void TIM3_SetIC2Prescaler(u8 TIM3_IC2Prescaler)
{
    u8 tmpccmr2 = 0;

    /* Check the parameters */
    assert_param(IS_TIM3_IC_PRESCALER_OK(TIM3_IC2Prescaler));

    tmpccmr2 = TIM3->CCMR2;

    /* Reset the IC2PSC Bits */
    tmpccmr2 &= (u8)(~TIM3_CCMR_ICxPSC);

    /* Set the IC2PSC value */
    tmpccmr2 |= TIM3_IC2Prescaler;

    TIM3->CCMR2 = tmpccmr2;
}

/**
  * @brief Gets the TIM3 Input Capture 1 value.
  * @param[in] :
  * None
  * @retval Capture Compare 1 Register value.
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Get the TIM3 Input Capture 1 value.
  * @code
  * u16 Value;
  * Value = TIM3_GetCapture1();
  * @endcode
  */
u16 TIM3_GetCapture1(void)
{
    u16 tmpccr1=0;
    u8 tmpccr1l, tmpccr1h;

    tmpccr1h = TIM3->CCR1H;
	tmpccr1l = TIM3->CCR1L;
    

    tmpccr1 = (u16)(tmpccr1l);
    tmpccr1 |= (u16)((u16)(tmpccr1h) << 8);
    /* Get the Capture 1 Register value */
    return tmpccr1;
}

/**
  * @brief Gets the TIM3 Input Capture 2 value.
  * @param[in] :
  * None
  * @retval Capture Compare 2 Register value.
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Get the TIM3 Input Capture 2 value.
  * @code
  * u16 Value;
  * Value = TIM3_GetCapture2();
  * @endcode
  */
u16 TIM3_GetCapture2(void)
{
    u16 tmpccr2=0;
    u8 tmpccr2l, tmpccr2h;

    tmpccr2h = TIM3->CCR2H;
	tmpccr2l = TIM3->CCR2L;
    

    tmpccr2 = (u16)(tmpccr2l);
    tmpccr2 |= (u16)((u16)(tmpccr2h) << 8);
    /* Get the Capture 2 Register value */
    return tmpccr2;
}

/**
  * @brief Gets the TIM3 Counter value.
  * @param[in] :
  * None
  * @retval Counter Register value.
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Get the TIM3 Counter value.
  * @code
  * u16 Value;
  * Value = TIM3_GetCounter();
  * @endcode
  */
u16 TIM3_GetCounter(void)
{
    u16 tmpcnt=0;
    u8 tmpcntrl, tmpcntrh;

    tmpcntrh = TIM3->CNTRH;
	tmpcntrl = TIM3->CNTRL;
    

    tmpcnt = (u16)(tmpcntrl);
    tmpcnt |= (u16)((u16)(tmpcntrh) << 8);
    /* Get the Counter Register value */
    return tmpcnt;
}


/**
  * @brief Gets the TIM3 Prescaler value.
  * @param[in] :
  * None
  * @retval Prescaler Register configuration value.
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Get the TIM3 Prescaler configurartion value.
  * @code
  * u8  Prescaler;
  * Prescaler = TIM3_GetPrescaler();
  * @endcode
  */
u8 TIM3_GetPrescaler(void)
{
    u8 tmppscr;

    tmppscr = TIM3->PSCR;
    
    /* Get the Prescaler Register value */
    return tmppscr;
}


/**
  * @brief Checks whether the specified TIM3 flag is set or not.
  * @param[in] TIM3_FLAG specifies the flag to check.
  * This parameter can be one of the following values:
  *                       - TIM3_FLAG_UPDATE: TIM3 update Flag
  *                       - TIM3_FLAG_CC1: TIM3 Capture Compare 1 Flag
  *                       - TIM3_FLAG_CC2: TIM3 Capture Compare 2 Flag
  *                       - TIM3_FLAG_CC1OF: TIM3 Capture Compare 1 overcapture Flag
  *                       - TIM3_FLAG_CC2OF: TIM3 Capture Compare 2 overcapture Flag
  * @retval FlagStatus The new state of TIM3_FLAG (SET or RESET).
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Check whether the TIM3_FLAG_UPDATE flag is set or not.
  * @code
  * FlagStatus FlagValue;
  * FlagValue = TIM3_GetFlagStatus(TIM3_FLAG_Update);
  * @endcode
  */
FlagStatus TIM3_GetFlagStatus(u16 TIM3_FLAG)
{
    FlagStatus bitstatus = RESET;
    u8 tim3_flag_l, tim3_flag_h;

    /* Check the parameters */
    assert_param(IS_TIM3_GET_FLAG_OK(TIM3_FLAG));

    tim3_flag_l= (u8)(TIM3_FLAG);
    tim3_flag_h= (u8)(TIM3_FLAG >> 8);

    if (((TIM3->SR1 & tim3_flag_l)|(TIM3->SR2 & tim3_flag_h)) != (u8)RESET )
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}


/**
  * @brief Clears the TIM3’s pending flags.
  * @param[in] TIM3_FLAG specifies the flag to clear.
  * This parameter can be one of the following values:
  *                       - TIM3_FLAG_UPDATE: TIM3 update Flag
  *                       - TIM3_FLAG_CC1: TIM3 Capture Compare 1 Flag
  *                       - TIM3_FLAG_CC2: TIM3 Capture Compare 2 Flag
  *                       - TIM3_FLAG_CC1OF: TIM3 Capture Compare 1 overcapture Flag
  *                       - TIM3_FLAG_CC2OF: TIM3 Capture Compare 2 overcapture Flag
  * @retval void None.
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Clear the TIM3_FLAG_UPDATE flag.
  * @code
  * TIM3_ClearFlag(TIM3_FLAG_Update);
  * @endcode
  */
void TIM3_ClearFlag(u16 TIM3_FLAG)
{
    u8 tim3_flag_l, tim3_flag_h;
    /* Check the parameters */
    assert_param(IS_TIM3_CLEAR_FLAG_OK(TIM3_FLAG));

    tim3_flag_l= (u8)(TIM3_FLAG);
    tim3_flag_h= (u8)(TIM3_FLAG >> 8);
    /* Clear the flags (rc_w0) clear this bit by writing 0. Writing ‘1’ has no effect*/
    TIM3->SR1 &= (u8)(~tim3_flag_l);
    TIM3->SR2 &= (u8)(~tim3_flag_h);
}


/**
  * @brief Checks whether the TIM3 interrupt has occurred or not.
  * @param[in] TIM3_IT specifies the TIM3 interrupt source to check.
  * This parameter can be one of the following values:
  *                       - TIM3_IT_UPDATE: TIM3 update Interrupt source
  *                       - TIM3_IT_CC1: TIM3 Capture Compare 1 Interrupt source
  *                       - TIM3_IT_CC2: TIM3 Capture Compare 2 Interrupt source
  * @retval ITStatus The new state of the TIM3_IT(SET or RESET).
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Check whether the TIM3_IT_UPDATE interrupt has occurred or not.
  * @code
  * ITStatus ITValue;
  * ITValue = TIM3_GetITStatus(TIM3_FLAG_Update);
  * @endcode
  */

ITStatus TIM3_GetITStatus(u8 TIM3_IT)
{
    ITStatus bitstatus = RESET;

    u8 TIM3_itStatus = 0x0, TIM3_itEnable = 0x0;

    /* Check the parameters */
    assert_param(IS_TIM3_GET_IT_OK(TIM3_IT));

    TIM3_itStatus = (u8)(TIM3->SR1 & TIM3_IT);

    TIM3_itEnable = (u8)(TIM3->IER & TIM3_IT);

    if ((TIM3_itStatus != (u8)RESET ) && (TIM3_itEnable != (u8)RESET ))
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}


/**
  * @brief Clears the TIM3's interrupt pending bits.
  * @param[in] TIM3_IT specifies the pending bit to clear.
  * This parameter can be one of the following values:
  *                       - TIM3_IT_UPDATE: TIM3 update Interrupt source
  *                       - TIM3_IT_CC1: TIM3 Capture Compare 1 Interrupt source
  *                       - TIM3_IT_CC2: TIM3 Capture Compare 2 Interrupt source
  * @retval void None.
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Clear the TIM3_IT_UPDATE interrupt pending bit.
  * @code
  * TIM3_ClearITPendingBit(TIM3_IT_Update);
  * @endcode
  */
void TIM3_ClearITPendingBit(u8 TIM3_IT)
{
    /* Check the parameters */
    assert_param(IS_TIM3_IT_OK(TIM3_IT));

    /* Clear the IT pending Bit */
    TIM3->SR1 &= (u8)(~TIM3_IT);
}


/**
  * @brief Configure the TI1 as Input.
  * @param[in] TIM3_ICPolarity  The Input Polarity.
  * This parameter can be one of the following values:
  *                       - TIM3_ICPOLARITY_FALLING
  *                       - TIM3_ICPOLARITY_RISING
  * @param[in] TIM3_ICSelection specifies the input to be used.
  * This parameter can be one of the following values:
  *                       - TIM3_ICSELECTION_DIRECTTI: TIM3 Input 1 is selected to
  *                         be connected to IC1.
  *                       - TIM3_ICSELECTION_INDIRECTTI: TIM3 Input 1 is selected to
  *                         be connected to IC2.
  * @param[in] TIM3_ICFilter Specifies the Input Capture Filter.
  * This parameter must be a value between 0x00 and 0x0F.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Configure the TI1 as Input selected to be connected to IC1 with Rising Polarity and 0x0E as Filter value.
  * @code
  * TI1_Config(TIM3_ICPOLARITY_RISING, TIM3_ICSELECTION_DIRECTTI,0x0E);
  * @endcode
  */
static void TI1_Config(u8 TIM3_ICPolarity, u8 TIM3_ICSelection,
                       u8 TIM3_ICFilter)
{
    u8 tmpccmr1 = 0;
    u8 tmpicpolarity = TIM3_ICPolarity;
    tmpccmr1 = TIM3->CCMR1;

    /* Disable the Channel 1: Reset the CCE Bit */
    TIM3->CCER1 &=  (u8)(~TIM3_CCER1_CC1E);

