xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_tim3.c
    /* Select the Input and set the filter */
    tmpccmr1 &= (u8)(~TIM3_CCMR_CCxS) & (u8)(~TIM3_CCMR_ICxF);
    tmpccmr1 |= (u8)(((u8)(TIM3_ICSelection)) | ((u8)(TIM3_ICFilter << 4)));

    TIM3->CCMR1 = tmpccmr1;


    /* Select the Polarity */
    if (tmpicpolarity == TIM3_ICPOLARITY_FALLING)
    {
        TIM3->CCER1 |= TIM3_CCER1_CC1P ;
    }
    else
    {
        TIM3->CCER1 &= (u8)(~TIM3_CCER1_CC1P) ;
    }

    /* Set the CCE Bit */
    TIM3->CCER1 |=  TIM3_CCER1_CC1E;
}


/**
  * @brief Configure the TI2 as Input.
  * @param[in] TIM3_ICPolarity  The Input Polarity.
  * This parameter can be one of the following values:
  *                       - TIM3_ICPOLARITY_FALLING
  *                       - TIM3_ICPOLARITY_RISING
  * @param[in] TIM3_ICSelection specifies the input to be used.
  * This parameter can be one of the following values:
  *                       - TIM3_ICSELECTION_DIRECTTI: TIM3 Input 2 is selected to
  *                         be connected to IC2.
  *                       - TIM3_ICSELECTION_INDIRECTTI: TIM3 Input 2 is selected to
  *                         be connected to IC1.
  * @param[in] TIM3_ICFilter Specifies the Input Capture Filter.
  * This parameter must be a value between 0x00 and 0x0F.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * * Configure the TI2 as Input selected to be connected to IC2 with Rising Polarity and 0x0E as Filter value.
  * @code
  * TI2_Config(TIM3_ICPOLARITY_RISING, TIM3_ICSELECTION_DIRECTTI,0x0E);
  * @endcode
  */
static void TI2_Config(u8 TIM3_ICPolarity, u8 TIM3_ICSelection,
                       u8 TIM3_ICFilter)
{
    u8 tmpccmr2 = 0;
		u8 tmpicpolarity = TIM3_ICPolarity;

    tmpccmr2 = TIM3->CCMR2;

    /* Disable the Channel 2: Reset the CCE Bit */
    TIM3->CCER1 &=  (u8)(~TIM3_CCER1_CC2E);

    /* Select the Input and set the filter */
    tmpccmr2 &= (u8)(~TIM3_CCMR_CCxS) & (u8)(~TIM3_CCMR_ICxF);
    tmpccmr2 |= (u8)(((u8)(TIM3_ICSelection)) | ((u8)(TIM3_ICFilter << 4)));

    TIM3->CCMR2 = tmpccmr2;

    /* Select the Polarity */
    if (tmpicpolarity == TIM3_ICPOLARITY_FALLING)
    {
        TIM3->CCER1 |= TIM3_CCER1_CC2P;
    }
    else
    {
        TIM3->CCER1 &= (u8)(~TIM3_CCER1_CC2P);
    }

    /* Set the CCE Bit */
    TIM3->CCER1 |=  TIM3_CCER1_CC2E;
}

/**
  * @brief Compute the frequency of the LSI clock expressed in Herz.
  * @param[in] TimerClockFreq  the TIM3 clock frequency expressed in Herz.
  * @retval u32 LSIClockFreq
  * @par Required preconditions:
  *  The timer clock must be a high speed clock: HSI or HSE
  * @par Called functions:
  * TIM3_ICInit
  * TIM3_ITConfig
  * TIM3_Cmd
  * TIM3_ClearFlag
  * @note It is recommended to use the maximum clock frequency, that is 10 MHz, to obtain a more precise result.
  * @par Example:
  * * Configure the TI1 as Input selected to be connected to IC1 with Rising Polarity and 0x0 as Filter value.
  * @code
  * u32 Flsi;
  * Flsi= TIM3_ComputeLsiClockFreq(16000000);
  * @endcode
  */
u32 TIM3_ComputeLsiClockFreq(u32 TimerClockFreq)
{
  TIM3_ICInit_TypeDef  TIM3_ICInitStruct;
  u32 LSIClockFreq;
  u16 ICValue1, ICValue2;
   /* Capture only every 8 events!!! */
  /* Enable capture of TI1 */
  TIM3_ICInitStruct.TIM3_Channel = TIM3_CHANNEL_1;
  TIM3_ICInitStruct.TIM3_ICPolarity = TIM3_ICPOLARITY_RISING;
  TIM3_ICInitStruct.TIM3_ICSelection = TIM3_ICSELECTION_DIRECTTI;
  TIM3_ICInitStruct.TIM3_ICPrescaler = TIM3_ICPSC_DIV8;
  TIM3_ICInitStruct.TIM3_ICFilter = 0x0; 
  TIM3_ICInit(&TIM3_ICInitStruct);

  
  /* Enable CC1 interrupt */
  TIM3_ITConfig(TIM3_IT_CC1, ENABLE); 
	
  /* Enable timer2 */
  TIM3_Cmd(ENABLE);
  
  TIM3->SR1 = 0x00;
  TIM3->SR2 = 0x00;
	
  /* Clear CC1 Flag*/
  TIM3_ClearFlag(TIM3_FLAG_CC1);
  
  /* wait a capture on cc1 */
  while((TIM3->SR1 & TIM3_FLAG_CC1) != TIM3_FLAG_CC1);
  /* Get CCR1 value*/
  ICValue1 = TIM3_GetCapture1();
  TIM3_ClearFlag(TIM3_FLAG_CC1);
  
  /* wait a capture on cc1 */
  while((TIM3->SR1 & TIM3_FLAG_CC1) != TIM3_FLAG_CC1);
  /* Get CCR1 value*/
  ICValue2 = TIM3_GetCapture1();
  TIM3_ClearFlag(TIM3_FLAG_CC1);
  
  /* Disable IC1 input capture */
  TIM3->CCER1 &= (u8)(~TIM3_CCER1_CC1E);
  /* Reset CCMR1 register */
  TIM3->CCMR1 = 0x00;
  /* Disable timer2 */
  TIM3_Cmd(DISABLE);

  /* Compute LSI clock frequency */
  LSIClockFreq = (8 * TimerClockFreq) / (ICValue2 - ICValue1);
  return LSIClockFreq;
}

/**
  * @}
  */
/******************* (C) COPYRIGHT 2007 STMicroelectronics *****END OF FILE****/
